{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "average-divide",
   "metadata": {},
   "source": [
    "# Dealing with Time"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "acoustic-grain",
   "metadata": {},
   "source": [
    "![Time tree](images/TimeTree_demo.png)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "foster-abraham",
   "metadata": {},
   "source": [
    "The [MIMIC III documentation](https://mimic.physionet.org/mimicdata/time/) describes all of the time fields. Some key points are:  \n",
    "\"Time in the database is stored with one of two suffixes: TIME and DATE. If a column has TIME as the suffix, e.g. CHARTTIME, then the data resolution is down to the minute. If the column has DATE as the suffix, e.g. CHARTDATE, then the data resolution is down to the day.\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "certain-basketball",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "unlimited-biotechnology",
   "metadata": {},
   "source": [
    "### Obtain a list of all timestamp fields in the MIMIC-III data  \n",
    "- Copy table of all data columns from https://mit-lcp.github.io/mimic-schema-spy/columns.byTable.html into a spreadsheet\n",
    "- Filter the \"Type\" column on timestamp and delete all other rows\n",
    "- Note that all timestamp columns have a size of 22 characters, suggesting that they likely have a uniform format across the database\n",
    "- Keep only the \"Table\" and \"Column\" columns and save to CSV"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "under-cowboy",
   "metadata": {},
   "outputs": [],
   "source": [
    "time_fields = pd.read_csv('MIMIC-III_timestamp_fields.csv')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "threatened-republican",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Table</th>\n",
       "      <th>Column</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>ADMITTIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>DEATHTIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>DISCHTIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>EDOUTTIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Admissions</td>\n",
       "      <td>EDREGTIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>Procedureevents_Mv</td>\n",
       "      <td>STARTTIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>Procedureevents_Mv</td>\n",
       "      <td>STORETIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>Services</td>\n",
       "      <td>TRANSFERTIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>72</th>\n",
       "      <td>Transfers</td>\n",
       "      <td>INTIME</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>Transfers</td>\n",
       "      <td>OUTTIME</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>74 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                 Table        Column\n",
       "0           Admissions     ADMITTIME\n",
       "1           Admissions     DEATHTIME\n",
       "2           Admissions     DISCHTIME\n",
       "3           Admissions     EDOUTTIME\n",
       "4           Admissions     EDREGTIME\n",
       "..                 ...           ...\n",
       "69  Procedureevents_Mv     STARTTIME\n",
       "70  Procedureevents_Mv     STORETIME\n",
       "71            Services  TRANSFERTIME\n",
       "72           Transfers        INTIME\n",
       "73           Transfers       OUTTIME\n",
       "\n",
       "[74 rows x 2 columns]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "time_fields.loc[:,'Table'] = time_fields.loc[:,'Table'].str.title()\n",
    "time_fields.loc[:,'Column'] = time_fields.loc[:,'Column'].str.upper()\n",
    "time_fields"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "educational-discrimination",
   "metadata": {},
   "source": [
    "### Initialize a connection to the neo4j database."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "turkish-charger",
   "metadata": {},
   "outputs": [
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      "\n",
      "Please enter the Neo4j database password to continue \n",
      " ·······\n"
     ]
    }
   ],
   "source": [
    "import getpass\n",
    "password = getpass.getpass(\"\\nPlease enter the Neo4j database password to continue \\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "light-decline",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "driver=GraphDatabase.driver(uri=\"bolt://localhost:7687\", auth=('neo4j',password))\n",
    "session=driver.session()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "elect-myrtle",
   "metadata": {},
   "source": [
    "### MERGE all timestamps as relationships into the time tree"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "robust-persian",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<neo4j.work.result.Result at 0x7f12acdb3cd0>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Create the root node of the time tree\n",
    "query = 'MERGE (t:Timetree {name:\"Time Tree\"})'\n",
    "session.run(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "inclusive-continuity",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Gaps:  376405 Iteration:  1\n",
      "Gaps:  280405 Iteration:  1\n",
      "Gaps:  190405 Iteration:  1\n",
      "Gaps:  131405 Iteration:  1\n",
      "Gaps:  81405 Iteration:  1\n",
      "Gaps:  35001 Iteration:  1\n",
      "Gaps:  13001 Iteration:  1\n",
      "Gaps:  4001 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n",
      "Gaps:  1 Iteration:  1\n"
     ]
    },
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "\u001b[0;32m<ipython-input-25-4db4d22be847>\u001b[0m in \u001b[0;36m<module>\u001b[0;34m\u001b[0m\n\u001b[1;32m     30\u001b[0m \u001b[0;31m#         print(Label, prop, count)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     31\u001b[0m         \u001b[0mcommand\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0;34m'CALL apoc.periodic.iterate('\u001b[0m\u001b[0;34m+\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m+\u001b[0m\u001b[0;34m', {batchSize:1000, parallel: true, iterateList:true})'\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 32\u001b[0;31m         \u001b[0msession\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrun\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcommand\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     33\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     34\u001b[0m     query = '''\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/neo4j/work/simple.py\u001b[0m in \u001b[0;36mrun\u001b[0;34m(self, query, parameters, **kwparameters)\u001b[0m\n\u001b[1;32m    215\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    216\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_autoResult\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mResult\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mcx\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mhydrant\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch_size\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_result_closed\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 217\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_autoResult\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_run\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mparameters\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdatabase\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_config\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdefault_access_mode\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_bookmarks\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;34m**\u001b[0m\u001b[0mkwparameters\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    218\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    219\u001b[0m         \u001b[0;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_autoResult\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/neo4j/work/result.py\u001b[0m in \u001b[0;36m_run\u001b[0;34m(self, query, parameters, db, access_mode, bookmarks, **kwparameters)\u001b[0m\n\u001b[1;32m     99\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_pull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    100\u001b[0m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0msend_all\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 101\u001b[0;31m         \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_attach\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    102\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    103\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_pull\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/neo4j/work/result.py\u001b[0m in \u001b[0;36m_attach\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    200\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_closed\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mFalse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    201\u001b[0m             \u001b[0;32mwhile\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_attached\u001b[0m \u001b[0;32mis\u001b[0m \u001b[0;32mFalse\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 202\u001b[0;31m                 \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_connection\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mfetch_message\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    203\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    204\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m_buffer_all\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/neo4j/io/_bolt4.py\u001b[0m in \u001b[0;36mfetch_message\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m    332\u001b[0m         \u001b[0;31m# Receive exactly one message\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    333\u001b[0m         \u001b[0;32mtry\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 334\u001b[0;31m             \u001b[0mdetails\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_signature\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0msummary_metadata\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mnext\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0minbox\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    335\u001b[0m         \u001b[0;32mexcept\u001b[0m \u001b[0;34m(\u001b[0m\u001b[0mIOError\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mOSError\u001b[0m\u001b[0;34m)\u001b[0m \u001b[0;32mas\u001b[0m \u001b[0merror\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    336\u001b[0m             log.error(\"Failed to read data from connection \"\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/neo4j/io/_common.py\u001b[0m in \u001b[0;36m__next__\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m     77\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     78\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0m__next__\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 79\u001b[0;31m         \u001b[0mtag\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mfields\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpop\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     80\u001b[0m         \u001b[0;32mif\u001b[0m \u001b[0mtag\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;34mb\"\\x71\"\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     81\u001b[0m             \u001b[0;32mreturn\u001b[0m \u001b[0mfields\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;32mNone\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/neo4j/io/_common.py\u001b[0m in \u001b[0;36mpop\u001b[0;34m(self)\u001b[0m\n\u001b[1;32m     71\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     72\u001b[0m     \u001b[0;32mdef\u001b[0m \u001b[0mpop\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 73\u001b[0;31m         \u001b[0;32mreturn\u001b[0m \u001b[0mnext\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0m_messages\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     74\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     75\u001b[0m \u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/neo4j/io/_common.py\u001b[0m in \u001b[0;36m_yield_messages\u001b[0;34m(self, sock)\u001b[0m\n\u001b[1;32m     51\u001b[0m                 \u001b[0;32mwhile\u001b[0m \u001b[0mchunk_size\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     52\u001b[0m                     \u001b[0;31m# Determine the chunk size and skip noop\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m---> 53\u001b[0;31m                     \u001b[0mbuffer\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mreceive\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0msock\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0;36m2\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m     54\u001b[0m                     \u001b[0mchunk_size\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mbuffer\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mpop_u16\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m     55\u001b[0m                     \u001b[0;32mif\u001b[0m \u001b[0mchunk_size\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;32m~/anaconda3/envs/jupyter_env/lib/python3.9/site-packages/neo4j/packstream.py\u001b[0m in \u001b[0;36mreceive\u001b[0;34m(self, sock, n_bytes)\u001b[0m\n\u001b[1;32m    603\u001b[0m         \u001b[0mview\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0mmemoryview\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mdata\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    604\u001b[0m         \u001b[0;32mwhile\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mused\u001b[0m \u001b[0;34m<\u001b[0m \u001b[0mend\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0;32m--> 605\u001b[0;31m             \u001b[0mn\u001b[0m \u001b[0;34m=\u001b[0m \u001b[0msock\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mrecv_into\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0mview\u001b[0m\u001b[0;34m[\u001b[0m\u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mused\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0mend\u001b[0m\u001b[0;34m]\u001b[0m\u001b[0;34m,\u001b[0m \u001b[0mend\u001b[0m \u001b[0;34m-\u001b[0m \u001b[0mself\u001b[0m\u001b[0;34m.\u001b[0m\u001b[0mused\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[0m\u001b[1;32m    606\u001b[0m             \u001b[0;32mif\u001b[0m \u001b[0mn\u001b[0m \u001b[0;34m==\u001b[0m \u001b[0;36m0\u001b[0m\u001b[0;34m:\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n\u001b[1;32m    607\u001b[0m                 \u001b[0;32mraise\u001b[0m \u001b[0mOSError\u001b[0m\u001b[0;34m(\u001b[0m\u001b[0;34m\"No data\"\u001b[0m\u001b[0;34m)\u001b[0m\u001b[0;34m\u001b[0m\u001b[0;34m\u001b[0m\u001b[0m\n",
      "\u001b[0;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "# Create all the year, month, and day nodes with relationships\n",
    "\n",
    "# Column name from MIMIC becomes relationship name.\n",
    "# Each node contains the datetime informationa for all higher nodes in the tree (example: month nodes contain\n",
    "# We iterate through all of the data fields that contain timestamp\n",
    "# data to write cypher code, which is then passed to Neo4j using the\n",
    "# apoc.periodic.iterate function.\n",
    "gaps = 1\n",
    "iteration = 1\n",
    "\n",
    "while gaps > 0:\n",
    "\n",
    "    count = 0\n",
    "    for index, row in time_fields.iterrows():\n",
    "        Label = row[0]\n",
    "        prop = row[1]\n",
    "        query = '''\n",
    "    \"MATCH (n:{Label})\n",
    "    WHERE NOT (n)-[:{prop}]->(:Day) AND n.{prop} =~ '[0-9]{{4}}-[0-9]{{2}}-[0-9]{{2}} [0-9]{{2}}:[0-9]{{2}}:[0-9]{{2}}' \n",
    "    WITH apoc.date.parse(n.{prop}, 'ms', 'yyyy-MM-dd HH:mm:ss', 'America/New York') AS ms, n\n",
    "    WITH datetime({{epochmillis: ms}}).year AS yr, datetime({{epochmillis: ms}}).month AS mo, datetime({{epochmillis: ms}}).day AS dt,\n",
    "    ms, n\n",
    "    RETURN yr, mo, dt, ms, n\",\n",
    "    \"MATCH (t:Timetree {{name:'Time Tree'}})\n",
    "    MERGE (t)<-[:OF]-(y:Year {{year:yr}})\n",
    "    MERGE (y)<-[:OF]-(m:Month {{year:yr, month:mo}})\n",
    "    MERGE (m)<-[:OF]-(d:Day {{year:yr, month:mo, day:dt}})\n",
    "    MERGE (d)<-[:{prop} {{{prop}:datetime({{epochmillis: ms}})}}]-(n)\"'''.format(Label=Label, prop=prop)\n",
    "        count += 1\n",
    "#         print(Label, prop, count)\n",
    "        command = 'CALL apoc.periodic.iterate('+query+', {batchSize:1000, parallel: true, iterateList:true})'\n",
    "        session.run(command)\n",
    "\n",
    "    query = '''\n",
    "    MATCH (n:Noteevents)\n",
    "    WHERE NOT (n)-[:STORETIME]->(:Day) AND EXISTS(n.STORETIME)\n",
    "    RETURN count(n) AS gaps'''\n",
    "    data = session.run(query)\n",
    "    for node in data:\n",
    "        gaps = node.get('gaps')\n",
    "        print ('Gaps: ',gaps, 'Iteration: ',iteration)\n",
    "    iteration =+ 1\n",
    "\n",
    "# Print a test query \n",
    "# print(command)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "western-affiliate",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2196-04-09 12:26:00 Admissions ADMITTIME\n",
      "2153-09-03 07:15:00 Admissions ADMITTIME\n",
      "2157-10-18 19:34:00 Admissions ADMITTIME\n",
      "2139-06-06 16:14:00 Admissions ADMITTIME\n",
      "2160-11-02 02:06:00 Admissions ADMITTIME\n",
      "2126-05-06 15:16:00 Admissions ADMITTIME\n",
      "None Admissions DEATHTIME\n",
      "None Admissions DEATHTIME\n",
      "None Admissions DEATHTIME\n",
      "None Admissions DEATHTIME\n",
      "None Admissions DEATHTIME\n",
      "None Admissions DEATHTIME\n",
      "2196-04-10 15:54:00 Admissions DISCHTIME\n",
      "2153-09-08 19:10:00 Admissions DISCHTIME\n",
      "2157-10-25 14:00:00 Admissions DISCHTIME\n",
      "2139-06-09 12:48:00 Admissions DISCHTIME\n",
      "2160-11-05 14:55:00 Admissions DISCHTIME\n",
      "2126-05-13 15:00:00 Admissions DISCHTIME\n",
      "2196-04-09 13:24:00 Admissions EDOUTTIME\n",
      "None Admissions EDOUTTIME\n",
      "None Admissions EDOUTTIME\n",
      "None Admissions EDOUTTIME\n",
      "2160-11-02 04:27:00 Admissions EDOUTTIME\n",
      "None Admissions EDOUTTIME\n",
      "2196-04-09 10:06:00 Admissions EDREGTIME\n",
      "None Admissions EDREGTIME\n",
      "None Admissions EDREGTIME\n",
      "None Admissions EDREGTIME\n",
      "2160-11-02 01:01:00 Admissions EDREGTIME\n",
      "None Admissions EDREGTIME\n",
      "2146-10-05 13:24:00 Callout ACKNOWLEDGETIME\n",
      "2114-11-28 09:43:08 Callout ACKNOWLEDGETIME\n",
      "2114-12-01 12:26:05 Callout ACKNOWLEDGETIME\n",
      "2136-12-29 10:33:51 Callout ACKNOWLEDGETIME\n",
      "2199-09-18 11:58:33 Callout ACKNOWLEDGETIME\n",
      "2162-11-30 11:15:08 Callout ACKNOWLEDGETIME\n",
      "2146-10-05 13:16:55 Callout CREATETIME\n",
      "2114-11-28 08:31:39 Callout CREATETIME\n",
      "2114-11-30 10:24:25 Callout CREATETIME\n",
      "2136-12-29 08:45:42 Callout CREATETIME\n",
      "2199-09-18 11:47:47 Callout CREATETIME\n",
      "2162-11-30 10:58:55 Callout CREATETIME\n",
      "None Callout CURRENTRESERVATIONTIME\n",
      "None Callout CURRENTRESERVATIONTIME\n",
      "None Callout CURRENTRESERVATIONTIME\n",
      "None Callout CURRENTRESERVATIONTIME\n",
      "None Callout CURRENTRESERVATIONTIME\n",
      "None Callout CURRENTRESERVATIONTIME\n",
      "2146-10-05 15:27:44 Callout FIRSTRESERVATIONTIME\n",
      "None Callout FIRSTRESERVATIONTIME\n",
      "None Callout FIRSTRESERVATIONTIME\n",
      "None Callout FIRSTRESERVATIONTIME\n",
      "None Callout FIRSTRESERVATIONTIME\n",
      "None Callout FIRSTRESERVATIONTIME\n",
      "2146-10-05 18:55:22 Callout OUTCOMETIME\n",
      "2114-11-28 12:10:02 Callout OUTCOMETIME\n",
      "2114-12-01 21:55:05 Callout OUTCOMETIME\n",
      "2136-12-29 18:10:02 Callout OUTCOMETIME\n",
      "2199-09-18 15:10:02 Callout OUTCOMETIME\n",
      "2162-11-30 18:31:05 Callout OUTCOMETIME\n",
      "2146-10-05 13:16:55 Callout UPDATETIME\n",
      "2114-11-28 09:42:08 Callout UPDATETIME\n",
      "2114-12-01 09:06:18 Callout UPDATETIME\n",
      "2136-12-29 10:17:16 Callout UPDATETIME\n",
      "2199-09-18 11:47:47 Callout UPDATETIME\n",
      "2162-11-30 18:31:05 Callout UPDATETIME\n",
      "CHARTTIME Chartevents CHARTTIME\n",
      "2134-05-12 12:00:00 Chartevents CHARTTIME\n",
      "2134-05-12 12:00:00 Chartevents CHARTTIME\n",
      "2134-05-12 12:00:00 Chartevents CHARTTIME\n",
      "2134-05-12 12:00:00 Chartevents CHARTTIME\n",
      "2134-05-12 12:00:00 Chartevents CHARTTIME\n",
      "STORETIME Chartevents STORETIME\n",
      "2134-05-12 13:56:00 Chartevents STORETIME\n",
      "2134-05-12 13:56:00 Chartevents STORETIME\n",
      "2134-05-12 12:18:00 Chartevents STORETIME\n",
      "2134-05-12 12:19:00 Chartevents STORETIME\n",
      "2134-05-12 12:19:00 Chartevents STORETIME\n",
      "CHARTDATE Cptevents CHARTDATE\n",
      "None Cptevents CHARTDATE\n",
      "None Cptevents CHARTDATE\n",
      "None Cptevents CHARTDATE\n",
      "None Cptevents CHARTDATE\n",
      "None Cptevents CHARTDATE\n",
      "CHARTTIME Datetimeevents CHARTTIME\n",
      "2172-03-14 11:00:00 Datetimeevents CHARTTIME\n",
      "2172-03-14 13:00:00 Datetimeevents CHARTTIME\n",
      "2172-03-14 15:00:00 Datetimeevents CHARTTIME\n",
      "2172-03-14 17:00:00 Datetimeevents CHARTTIME\n",
      "2172-03-14 19:00:00 Datetimeevents CHARTTIME\n",
      "STORETIME Datetimeevents STORETIME\n",
      "2172-03-14 11:52:00 Datetimeevents STORETIME\n",
      "2172-03-14 12:36:00 Datetimeevents STORETIME\n",
      "2172-03-14 15:10:00 Datetimeevents STORETIME\n",
      "2172-03-14 17:01:00 Datetimeevents STORETIME\n",
      "2172-03-14 19:29:00 Datetimeevents STORETIME\n",
      "VALUE Datetimeevents VALUE\n",
      "None Datetimeevents VALUE\n",
      "None Datetimeevents VALUE\n",
      "None Datetimeevents VALUE\n",
      "None Datetimeevents VALUE\n",
      "None Datetimeevents VALUE\n",
      "INTIME Icustays INTIME\n",
      "2198-02-14 23:27:38 Icustays INTIME\n",
      "2170-11-05 11:05:29 Icustays INTIME\n",
      "2128-06-24 15:05:20 Icustays INTIME\n",
      "2120-08-07 23:12:42 Icustays INTIME\n",
      "2186-12-25 21:08:04 Icustays INTIME\n",
      "OUTTIME Icustays OUTTIME\n",
      "2198-02-18 05:26:11 Icustays OUTTIME\n",
      "2170-11-08 17:46:57 Icustays OUTTIME\n",
      "2128-06-27 12:32:29 Icustays OUTTIME\n",
      "2120-08-10 00:39:04 Icustays OUTTIME\n",
      "2186-12-27 12:01:13 Icustays OUTTIME\n",
      "CHARTTIME Inputevents_Cv CHARTTIME\n",
      "2193-09-11 09:00:00 Inputevents_Cv CHARTTIME\n",
      "2193-09-11 12:00:00 Inputevents_Cv CHARTTIME\n",
      "2193-09-11 16:00:00 Inputevents_Cv CHARTTIME\n",
      "2193-09-11 19:00:00 Inputevents_Cv CHARTTIME\n",
      "2193-09-11 21:00:00 Inputevents_Cv CHARTTIME\n",
      "STORETIME Inputevents_Cv STORETIME\n",
      "2193-09-11 11:12:00 Inputevents_Cv STORETIME\n",
      "2193-09-11 12:05:00 Inputevents_Cv STORETIME\n",
      "2193-09-11 16:52:00 Inputevents_Cv STORETIME\n",
      "2193-09-11 19:06:00 Inputevents_Cv STORETIME\n",
      "2193-09-11 21:19:00 Inputevents_Cv STORETIME\n",
      "COMMENTS_DATE Inputevents_Mv COMMENTS_DATE\n",
      "2133-02-05 12:52:00 Inputevents_Mv COMMENTS_DATE\n",
      "None Inputevents_Mv COMMENTS_DATE\n",
      "None Inputevents_Mv COMMENTS_DATE\n",
      "2133-02-03 17:06:00 Inputevents_Mv COMMENTS_DATE\n",
      "2133-02-03 17:06:00 Inputevents_Mv COMMENTS_DATE\n",
      "ENDTIME Inputevents_Mv ENDTIME\n",
      "2133-02-05 08:45:00 Inputevents_Mv ENDTIME\n",
      "2133-02-05 06:30:00 Inputevents_Mv ENDTIME\n",
      "2133-02-05 06:30:00 Inputevents_Mv ENDTIME\n",
      "2133-02-03 12:01:00 Inputevents_Mv ENDTIME\n",
      "2133-02-03 12:01:00 Inputevents_Mv ENDTIME\n",
      "STARTTIME Inputevents_Mv STARTTIME\n",
      "2133-02-05 06:29:00 Inputevents_Mv STARTTIME\n",
      "2133-02-05 05:34:00 Inputevents_Mv STARTTIME\n",
      "2133-02-05 05:34:00 Inputevents_Mv STARTTIME\n",
      "2133-02-03 12:00:00 Inputevents_Mv STARTTIME\n",
      "2133-02-03 12:00:00 Inputevents_Mv STARTTIME\n",
      "STORETIME Inputevents_Mv STORETIME\n",
      "2133-02-05 06:27:00 Inputevents_Mv STORETIME\n",
      "2133-02-05 12:57:00 Inputevents_Mv STORETIME\n",
      "2133-02-05 12:57:00 Inputevents_Mv STORETIME\n",
      "2133-02-03 13:21:00 Inputevents_Mv STORETIME\n",
      "2133-02-03 13:21:00 Inputevents_Mv STORETIME\n",
      "CHARTTIME Labevents CHARTTIME\n",
      "2101-10-12 16:07:00 Labevents CHARTTIME\n",
      "2101-10-12 18:17:00 Labevents CHARTTIME\n",
      "2101-10-12 18:17:00 Labevents CHARTTIME\n",
      "2101-10-12 18:17:00 Labevents CHARTTIME\n",
      "2101-10-12 18:17:00 Labevents CHARTTIME\n",
      "CHARTDATE Microbiologyevents CHARTDATE\n",
      "2156-04-13 00:00:00 Microbiologyevents CHARTDATE\n",
      "2156-04-20 00:00:00 Microbiologyevents CHARTDATE\n",
      "2156-04-20 00:00:00 Microbiologyevents CHARTDATE\n",
      "2156-04-20 00:00:00 Microbiologyevents CHARTDATE\n",
      "2156-04-20 00:00:00 Microbiologyevents CHARTDATE\n",
      "CHARTTIME Microbiologyevents CHARTTIME\n",
      "2156-04-13 14:18:00 Microbiologyevents CHARTTIME\n",
      "2156-04-20 13:10:00 Microbiologyevents CHARTTIME\n",
      "2156-04-20 16:00:00 Microbiologyevents CHARTTIME\n",
      "None Microbiologyevents CHARTTIME\n",
      "None Microbiologyevents CHARTTIME\n",
      "CHARTDATE Noteevents CHARTDATE\n",
      "2151-08-04 Noteevents CHARTDATE\n",
      "2118-06-14 Noteevents CHARTDATE\n",
      "2119-05-25 Noteevents CHARTDATE\n",
      "2124-08-18 Noteevents CHARTDATE\n",
      "2162-03-25 Noteevents CHARTDATE\n",
      "CHARTTIME Noteevents CHARTTIME\n",
      "None Noteevents CHARTTIME\n",
      "None Noteevents CHARTTIME\n",
      "None Noteevents CHARTTIME\n",
      "None Noteevents CHARTTIME\n",
      "None Noteevents CHARTTIME\n",
      "STORETIME Noteevents STORETIME\n",
      "None Noteevents STORETIME\n",
      "None Noteevents STORETIME\n",
      "None Noteevents STORETIME\n",
      "None Noteevents STORETIME\n",
      "None Noteevents STORETIME\n",
      "CHARTTIME Outputevents CHARTTIME\n",
      "2142-09-08 10:00:00 Outputevents CHARTTIME\n",
      "2142-09-08 12:00:00 Outputevents CHARTTIME\n",
      "2142-09-08 13:00:00 Outputevents CHARTTIME\n",
      "2142-09-08 14:00:00 Outputevents CHARTTIME\n",
      "2142-09-08 16:00:00 Outputevents CHARTTIME\n",
      "STORETIME Outputevents STORETIME\n",
      "2142-09-08 12:08:00 Outputevents STORETIME\n",
      "2142-09-08 12:08:00 Outputevents STORETIME\n",
      "2142-09-08 13:39:00 Outputevents STORETIME\n",
      "2142-09-08 16:17:00 Outputevents STORETIME\n",
      "2142-09-08 16:17:00 Outputevents STORETIME\n",
      "DOB Patients DOB\n",
      "2075-03-13 00:00:00 Patients DOB\n",
      "2164-12-27 00:00:00 Patients DOB\n",
      "2090-03-15 00:00:00 Patients DOB\n",
      "2078-03-06 00:00:00 Patients DOB\n",
      "2089-11-26 00:00:00 Patients DOB\n",
      "DOD Patients DOD\n",
      "None Patients DOD\n",
      "2188-11-22 00:00:00 Patients DOD\n",
      "None Patients DOD\n",
      "None Patients DOD\n",
      "None Patients DOD\n",
      "DOD_HOSP Patients DOD_HOSP\n",
      "None Patients DOD_HOSP\n",
      "2188-11-22 00:00:00 Patients DOD_HOSP\n",
      "None Patients DOD_HOSP\n",
      "None Patients DOD_HOSP\n",
      "None Patients DOD_HOSP\n",
      "DOD_SSN Patients DOD_SSN\n",
      "None Patients DOD_SSN\n",
      "None Patients DOD_SSN\n",
      "None Patients DOD_SSN\n",
      "None Patients DOD_SSN\n",
      "None Patients DOD_SSN\n",
      "ENDDATE Prescriptions ENDDATE\n",
      "2175-06-12 00:00:00 Prescriptions ENDDATE\n",
      "2175-06-12 00:00:00 Prescriptions ENDDATE\n",
      "2175-06-12 00:00:00 Prescriptions ENDDATE\n",
      "2175-06-12 00:00:00 Prescriptions ENDDATE\n",
      "2175-06-12 00:00:00 Prescriptions ENDDATE\n",
      "STARTDATE Prescriptions STARTDATE\n",
      "2175-06-11 00:00:00 Prescriptions STARTDATE\n",
      "2175-06-11 00:00:00 Prescriptions STARTDATE\n",
      "2175-06-11 00:00:00 Prescriptions STARTDATE\n",
      "2175-06-11 00:00:00 Prescriptions STARTDATE\n",
      "2175-06-11 00:00:00 Prescriptions STARTDATE\n",
      "COMMENTS_DATE Procedureevents_Mv COMMENTS_DATE\n",
      "None Procedureevents_Mv COMMENTS_DATE\n",
      "None Procedureevents_Mv COMMENTS_DATE\n",
      "None Procedureevents_Mv COMMENTS_DATE\n",
      "None Procedureevents_Mv COMMENTS_DATE\n",
      "None Procedureevents_Mv COMMENTS_DATE\n",
      "ENDTIME Procedureevents_Mv ENDTIME\n",
      "2145-03-12 23:05:00 Procedureevents_Mv ENDTIME\n",
      "2145-03-12 23:05:00 Procedureevents_Mv ENDTIME\n",
      "2145-03-18 20:01:00 Procedureevents_Mv ENDTIME\n",
      "2145-03-12 23:37:00 Procedureevents_Mv ENDTIME\n",
      "2145-03-16 16:00:00 Procedureevents_Mv ENDTIME\n",
      "STARTTIME Procedureevents_Mv STARTTIME\n",
      "2145-03-12 23:04:00 Procedureevents_Mv STARTTIME\n",
      "2145-03-12 23:04:00 Procedureevents_Mv STARTTIME\n",
      "2145-03-12 23:05:00 Procedureevents_Mv STARTTIME\n",
      "2145-03-12 23:36:00 Procedureevents_Mv STARTTIME\n",
      "2145-03-13 01:27:00 Procedureevents_Mv STARTTIME\n",
      "STORETIME Procedureevents_Mv STORETIME\n",
      "2145-03-12 23:04:00 Procedureevents_Mv STORETIME\n",
      "2145-03-12 23:04:00 Procedureevents_Mv STORETIME\n",
      "2145-03-18 20:01:39 Procedureevents_Mv STORETIME\n",
      "2145-03-12 23:36:00 Procedureevents_Mv STORETIME\n",
      "2145-03-16 17:57:00 Procedureevents_Mv STORETIME\n",
      "TRANSFERTIME Services TRANSFERTIME\n",
      "2122-07-22 14:07:27 Services TRANSFERTIME\n",
      "2122-07-26 18:31:49 Services TRANSFERTIME\n",
      "2172-09-28 19:22:15 Services TRANSFERTIME\n",
      "2201-01-09 20:16:45 Services TRANSFERTIME\n",
      "2181-03-23 08:24:41 Services TRANSFERTIME\n",
      "INTIME Transfers INTIME\n",
      "2142-04-29 15:27:11 Transfers INTIME\n",
      "2142-05-04 20:38:33 Transfers INTIME\n",
      "2142-05-05 11:46:32 Transfers INTIME\n",
      "2144-07-01 04:13:59 Transfers INTIME\n",
      "2144-07-01 05:19:39 Transfers INTIME\n",
      "OUTTIME Transfers OUTTIME\n",
      "2142-05-04 20:38:33 Transfers OUTTIME\n",
      "2142-05-05 11:46:32 Transfers OUTTIME\n",
      "None Transfers OUTTIME\n",
      "2144-07-01 05:19:39 Transfers OUTTIME\n",
      "2144-07-01 06:28:29 Transfers OUTTIME\n"
     ]
    }
   ],
   "source": [
    "# Check for variations in the date formats of various properties\n",
    "for index, row in time_fields.iterrows():\n",
    "    Label = row[0]\n",
    "    prop = row[1]\n",
    "    query = 'MATCH (n:{Label}) RETURN n.{prop} AS prop LIMIT 6'''.format(Label=Label, prop=prop)\n",
    "    data = session.run(query)\n",
    "    for node in data:\n",
    "        print(node.get('prop'), Label, prop)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "chicken-flower",
   "metadata": {},
   "source": [
    "### Parameters used with apoc.periodic.iterate function  \n",
    "Multiple parameters were attempted for the apoc.periodic.iterate function while building the time tree, noted below:\n",
    "\n",
    "|batchSize|parallel|iterateList|observed velocity of relationship creation|CPU notes|Java RAM usage|  \n",
    "|:---|:---|:---|:---|:---|:---|  \n",
    "|10|true|true|3500/second|all 12 CPUs at ~100% initially, then all dropped to ~25%|6.9GB|  \n",
    "|100|true|true|22600/second (may be incorrect)|all 12 CPUs at ~100% initially, then all dropped to ~40-45%|7.6GB|  \n",
    "|1000|true|true|11850/second|all 12 CPUs at ~100% initially, then all dropped to ~75%|8.1GB|  \n",
    "\n",
    "Using parallell=false was also attempted, but this setting used only 1 CPU and was visibly slower than the other methods, so it was aborted.\n",
    "\n",
    "### Size of the tree\n",
    "Prior to building time tree there were about 587,770,000 relationships in the database. After building the time tree there were 904,108,341 relationships in the database. The tree itself contained:\n",
    "\n",
    "|Label|Nodes Count|\n",
    "|:---|:---|   \n",
    "|Days|55848|  \n",
    "|Months|3314|  \n",
    "|Years|311|  \n",
    "|Time Tree root|1| \n",
    "\n",
    "The years spanned from year 1800 to year 2244, which is 444 years. As the table above demonstrates, only 311 of the possible 444 years actually appeared in timestamp data, which makes sense given the randomization scheme for shifting dates used during the anonymization process ([see here for details](https://mimic.physionet.org/mimicdata/time/)). \n",
    "\n",
    "\n",
    "The available disk space decreased by 149 GB after the time tree was created."
   ]
  },
  {
   "cell_type": "markdown",
   "id": "modular-martin",
   "metadata": {},
   "source": [
    "## Performance Testing\n",
    "---"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "alien-strategy",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "handed-eleven",
   "metadata": {},
   "source": [
    "### Close the connection to the neo4j database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "female-wealth",
   "metadata": {},
   "outputs": [],
   "source": [
    "session.close()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
